app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`login` = 'kocude04' LIMIT 1
INSERT INTO `users` (`login`, `has_password`, `salt`, `hashed_password`, `created_at`, `updated_at`) VALUES ('kocude04', 0, '', '', '2017-07-26 16:18:07.873861', '2017-07-26 16:18:07.873861')
UPDATE `users` SET `content` = '', `updated_at` = '2017-07-26 16:18:07.880861' WHERE `users`.`id` = 1
---
  def main
    login = params[:login]

    if login.nil?
      redirect_to '/' + User.random_login
      return
    end

    @user = User.find_by_login(login)

    # Creates new user
    if @user.nil?
      @user = User.new
      @user.login = login
      @user.password = ''
      @user.content = '[]'
      @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`login` = 'qytygi10' LIMIT 1
UPDATE `users` SET `content` = '[{\"title\":\"Link\",\"src\":\"https://en.wikipedia.org/wiki/Main_Page\"},{\"title\":\"Link\",\"src\":\"http://wikipedia.com\"}]', `updated_at` = '2017-07-26 16:57:02.869009' WHERE `users`.`id` = 9
---
  def new_tab

    login = params[:login]

    @user = User.find_by_login(login)

    json_content = @user.json_content

    json_content.push({
      "title" => "Link",
      "src" => params[:url],
      "guid" => Guid.new.to_s
    })

    @user.content = json_content.to_json

    @user.save